In [ ]:
# Create Code to import data from NIRF without marks

## Using Selenium

In [1]:
from selenium import webdriver
from selenium.webdriver.common.by import By
import pandas as pd
from selenium.webdriver.chrome.service import Service

# Chrome Version
- Version 129.0.6668.71 (Official Build) (arm64)
- Latest ChromeDriver 114.0.5735.90
- chrome://settings/help
- https://developer.chrome.com/docs/chromedriver/downloads

In [2]:
import time

In [3]:
# Path to your ChromeDriver
cp2 = '/opt/homebrew/bin/chromedriver'  # Replace with the actual path to your chromedriver

??webdriver.chrome

In [4]:
#!pip install webdriver-manager
from webdriver_manager.chrome import ChromeDriverManager

In [152]:
# Open the NIRF rankings page
n24ob1 = "https://www.nirfindia.org/Rankings/2024/OverallRanking150.html"
n24ob2 = "https://www.nirfindia.org/Rankings/2024/OverallRanking200.html"
n24ub1 = "https://www.nirfindia.org/Rankings/2023/UniversityRanking150.html"
n24ub2 = "https://www.nirfindia.org/Rankings/2023/UniversityRanking200.html"

url = n24ub2; nData = 'n24U_b2' ; cat1 = '151-200'
print(nData, cat1, '\n', url)

n24U_b2 151-200
 https://www.nirfindia.org/Rankings/2023/UniversityRanking200.html

In [153]:
#University Rankings

#url = n20u; nData = 'n20u'
print(nData, url)

n24U_b2 https://www.nirfindia.org/Rankings/2023/UniversityRanking200.html

In [154]:
#driver.refresh()

In [155]:
cService = webdriver.ChromeService(executable_path='/opt/homebrew/bin/chromedriver')
driver = webdriver.Chrome(service = cService)

In [156]:
driver.get(url)
#driver.maximize_window()
time.sleep(5)  # Adjust time if needed, or you can use Selenium's explicit waits

In [157]:
print(driver.title)

MoE, National Institute Ranking Framework (NIRF)

In [158]:
# Locate the table on the page
table = driver.find_element(By.TAG_NAME, 'table')

In [159]:
table

In [160]:
# Extract table headers
headers = []
header_elements = table.find_elements(By.TAG_NAME, 'th')
for header in header_elements:
    headers.append(header.text.strip())

In [161]:
print(headers[0:3])

['Name', 'City', 'State']

In [162]:
print(headers[0:3], len(headers))

['Name', 'City', 'State'] 3

In [163]:
# Extract table rows
rows = []
row_elements = table.find_elements(By.TAG_NAME, 'tr')

In [164]:
#print(row_elements[0:5])

In [165]:
# Loop through rows to extract data
for row in row_elements[1:]:  # Skipping the header row
    cols = row.find_elements(By.TAG_NAME, 'td')
    cols = [col.text.strip() for col in cols]
    rows.append(cols)

In [166]:
rows[0:3]
#1 row into 3 rows  : 2 & 3rd row are blanks

[['Ahmedabad University', 'Ahmedabad', 'Gujarat'],
 ['Amity University Rajasthan,Jaipur', 'Jaipur', 'Rajasthan'],
 ['Anand Agricultural University', 'Anand', 'Gujarat']]

In [167]:
print(len(rows), len(headers))

51 3

In [168]:
print(headers[0:3])

['Name', 'City', 'State']

In [169]:
print(rows[0:5])

[['Ahmedabad University', 'Ahmedabad', 'Gujarat'], ['Amity University Rajasthan,Jaipur', 'Jaipur', 'Rajasthan'], ['Anand Agricultural University', 'Anand', 'Gujarat'], ['B. S. Abdur Rahman Crescent Institute of Science and Technology', 'Chennai', 'Tamil Nadu'], ['Central Agricultural University', 'Imphal West', 'Manipur']]

In [170]:
#print(rows[0:300:3])

In [171]:
# Create a DataFrame from the extracted data
df1 = pd.DataFrame(rows[0:len(rows)], columns=headers[0:3])

In [172]:
df1.head(2)

                                Name       City      State
0               Ahmedabad University  Ahmedabad    Gujarat
1  Amity University Rajasthan,Jaipur     Jaipur  Rajasthan

In [173]:
list(df1.columns)

['Name', 'City', 'State']

In [174]:
df1.columns = ['name','city','state']

In [175]:
df1.head(2)

                                name       city      state
0               Ahmedabad University  Ahmedabad    Gujarat
1  Amity University Rajasthan,Jaipur     Jaipur  Rajasthan

In [176]:
df1B = df1.copy()
df1B.head(2)

                                name       city      state
0               Ahmedabad University  Ahmedabad    Gujarat
1  Amity University Rajasthan,Jaipur     Jaipur  Rajasthan

In [177]:
df1B.shape

(51, 3)

In [178]:
df1B['cat'] = cat1
df1B.head()

,name,city,state,cat
0,Ahmedabad University,Ahmedabad,Gujarat,151-200
1,"Amity University Rajasthan,Jaipur",Jaipur,Rajasthan,151-200
2,Anand Agricultural University,Anand,Gujarat,151-200
3,B. S. Abdur Rahman Crescent Institute of Scien...,Chennai,Tamil Nadu,151-200
4,Central Agricultural University,Imphal West,Manipur,151-200

In [179]:
dfNO = pd.concat([df1B.reset_index(drop=True)], axis=1)
dfNO['nYear'] = nData

In [180]:
dfNO.head(2)

                                name       city      state      cat    nYear
0               Ahmedabad University  Ahmedabad    Gujarat  151-200  n24U_b2
1  Amity University Rajasthan,Jaipur     Jaipur  Rajasthan  151-200  n24U_b2

In [181]:
# Close the browser
driver.quit()

In [182]:
# Display the extracted data
#print(dfNO)

In [183]:
# Save the data to a CSV file
fileLoc  = '/Users/du/dup/auData/ranking/nirf/'
fileName = fileLoc +  nData + '.csv'
print(nData, fileName)

n24U_b2 /Users/du/dup/auData/ranking/nirf/n24U_b2.csv

In [184]:
dfNO.to_csv(fileName, index=False)

In [185]:
import os

In [186]:
print(' '.join(map(str, os.listdir(fileLoc))))

Innovation nirf22R.csv nirf22P.csv N23scores.pdf n24u.csv nirf2122P.csv .DS_Store IR2024_Report.pdf n21o.csv n22u.csv Law Management pdf NIRF 2023 Data Summary.pdf n23u.csv n20o.csv n24O_b1.csv n20u.csv n23o.csv nirf24o.csv Architecture NIRFall.csv n24O_b2.csv nirfAU.csv n24U_b2.csv n22o.csv n21u.csv n24U_b1.csv nirf21A.csv N23Scores.csv n2oo.csv n24o.csv Overall Engineering nirfScores.csv

## End of Coding

In [187]:
pd.read_csv(fileName).head(2)

                                name       city      state      cat    nYear
0               Ahmedabad University  Ahmedabad    Gujarat  151-200  n24U_b2
1  Amity University Rajasthan,Jaipur     Jaipur  Rajasthan  151-200  n24U_b2